app/views/groups/show.html.erb

SELECT 1 AS one FROM "expenses" INNER JOIN "group_expenses" ON "expenses"."id" = "group_expenses"."expense_id" WHERE "group_expenses"."group_id" = $1 LIMIT $2  [["group_id", 4], ["LIMIT", 1]]
---
    <div>
      <% if @group.expenses.empty? %>