app/views/groups/show.html.erb

SELECT 1 AS one FROM "entities" INNER JOIN "group_entities" ON "entities"."id" = "group_entities"."entity_id" WHERE "group_entities"."group_id" = $1 LIMIT $2  [["group_id", 326], ["LIMIT", 1]]
---
    <div>
      <% if @group.entities.empty? %>