app/controllers/entities_controller.rb

  def index
    @user = current_user
    @group = Group.find(params[:group_id])
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 373], ["LIMIT", 1]]

  def new
    @user = current_user
    @entity = @user.entities.new
    @group = Group.find(params[:group_id]) if params[:group_id].present?
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 539], ["LIMIT", 1]]