app/controllers/expenses_controller.rb

  def index
    @user = current_user
    @group = Group.find(params[:group_id])
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]

  def new
    @user = current_user
    @expense = @user.expenses.new
    @groups = current_user.groups
    @group = Group.find(params[:group_id]) if params[:group_id].present?
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]