app/controllers/groups_controller.rb

  def index
    @user = current_user
    @groups = @user.groups
---
SELECT "groups".* FROM "groups" WHERE "groups"."user_id" = $1  [["user_id", 161]]

  def show
    @group = Group.includes(:entities).find(params[:id])
    @total_payment = @group.entities.sum(:amount)
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 326], ["LIMIT", 1]]
SELECT SUM("entities"."amount") FROM "entities" INNER JOIN "group_entities" ON "entities"."id" = "group_entities"."entity_id" WHERE "group_entities"."group_id" = $1  [["group_id", 326]]